{"name":"dave","date":1150706713,"url":"","message":"hey Josh. Stumbled onto your site thu K's link. Been thinkin of you off an on since then. I have no textbook anwers from  what i call `Christianese standard response cookbook'  (ie. take 200 grams  of prayer, blend gently with 4 hours praise, then drizzle with one day's fasting and mix at full speed for 10 mins with homegroup fellowship- there you have it. a healing cake)  Nah. But i can sympathise and empathise to some degree. Over 10 years ago something happened that totally destroyed  the life i thought i had, and the things i thought i was going to do with God and even for Him. It meant i no longer had the family that i thanked Him for every day and the loss was so great that i didn't think i would survive it.  I was very angry with Him and basically turned on myself, lived very hard and did things i'd not thought of doing for years. Stupid stuff... I still actually can't see the point in it all- why my kids had to go through all that unpleasant stuff and how, possibly or in any way it served as any decent kind purpose. It was a bad witness if nothing else. But i am sure of this. God knew what i was capable of surviving, even if i didn't. Our friend CS Lewis says  (in A Grief Observed - i think) that we don't know what our faith is worth until everything we thought we had or valued was on the line- and that God knows our potential even if we don't. - I relate to your dilemma with  Fibromialga (tho i think i spelled it wrong) too. I had a partner a few years back that suffered from it after a car accident and no one woud affirm that the condition even existed- they said it was all in her head.  She has since recovered and is fire dancing and performing at festivals and doing all sorts of physically demanding stuff. It was in God's time. Don't give up man. You guys are still young. I know that doesn't help right `now'. . .But things have a way of working out in God that will defy your understanding, both right now and in the future.  Would love to rap with you some more one time when you're at unley- cos if i had more time i could go into more detail.   A hug your way<br>Dave","email":"eeddc0ac9a7a40028cd08620bc692cf3","_id":"08c518c6-4334-11e9-97b3-6f99fb1efa11"}