{"name":"Sister Vic","date":1143922170,"url":"http:\/\/www.nunnsense.net","message":"I think that one of the difficulties with growing up within a Christian family and being a Christian for most of your life, is that you can become deaf and blind to God's presence. It's almost like God becomes a hum in the background of your life and you can no longer hear Him.  It's like He is the sky - you know it's there and it's blue, but you don't bother looking at it any more. God can become like that in your life.<br><br>I've seen it happen time and time again, and for many years I pondered why many Christians in this situation walked away from God as a result of not having proof of his existence or no sense of His presence. I didn't know how to respond when many years ago, a Christian friend asked me why he couldn't hear God and was questioning his faith. He began to doubt all that he had been taught.<br><br>If I could talk to him now I would say, \"If you truly want God to show you He is real and to have a real sense of His presence, then be prepared for difficulties and battles.  It is through these that God often reaches us - when we are at the bottom of a pit of suffering and pain, or loss and heartbreak, that we can let go of the preconceptions we have built up of who God is, and destroy the barriers we unconsciously build between us and Him.\"<br><br>Sometimes we build the barriers in a foolish endeavour to protect ourselves from Him and others, and sometimes to fool ourselves into thinking we are someehing better than we really are - to hide ourselves from the true vision of our fallen humanity.<br><br>Once those barriers come down, then God can reach through to you.<br><br>To knock those barriers down, can require a time of pain and difficulty, and it is through these difficuties, when we are free of hindrances and pretension that we can be open and true with ourselves and open and true with God.<br><br>But it takes a brave soul to ask that of God - to be willing to go through pain and suffering to REALLY know him.<br><br>Are you willing?","email":"a64f202fd5587028efd6f2382682eb0b","_id":"08cf8e78-4334-11e9-8fcd-032823e3f64a"}