{"name":"screenbeard","date":1149107760,"url":"http:\/\/the.geekorium.com","message":"Your comparison to cars might have been roughly true ten, five or even 2 years ago, but now is completely false. In my experience a Mac takes less configuration (none sometimes) to use a wider range of technology straight out of the box than a PC running Windows. Admittedly a Dell configured with their out-of-the-box software *might* happily connect to a wireless network, a bluetooth phone or a USB printer with few hiccups - but it takes software from third parties to do it.<br><br>Apple, on the other hand, will do all this with their own software - and because it's all Apple brand you can pick up the photo from one program and drop it into another, spit it out to a printer (without installing drivers) or connect to the Mac in the other room effortlessly and drop the finished product there.<br><br>There are just innumerable ways that a Mac makes daily computing easier. Take for instance the integration of PDF services. I didn't know my Mac could make a PDF without extra software, but I opened it up that first day, and there it was - with built in software to read a PDF file as well. To achieve the same with Windows, you must install two Adobe products or other third party products. People say there is less software for Apple, but in many cases - it's not necessary, cause (as in this case) it's built in already. There are many more examples like this that hint at what people mean when they say \"Macs Just Work\".<br><br>Little surprises such as this make everyday Mac use more pleasant. People ask me to do significant computer tasks for them and in general, I'd much rather take them and do them on my Mac than on a PC.<br><br>You say that \"things work so beautifully on a PC\", but you wouldn't say that if you'd used a Mac for anything significant.<br><br>And finally - *nothing* can have \"more than 100% compatibility\".","email":"d5dff3f4ad8eb3cd8bf83da7335bb98d","_id":"09b5384c-4334-11e9-9b93-874f89aa68d9"}